app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
		task = Task.find_by(id: params[:task_id].to_i)
		user = User.find_by(id: params[:user_id].to_i)

INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "vv"], ["description", "cccccc"], ["created_at", 2016-08-23 19:27:41 UTC], ["updated_at", 2016-08-23 19:27:41 UTC]]
---
  def create
		auth_header = request.headers['Authorization']
		accept_header = request.headers['Accept']
		p "auth header: ", auth_header, "acc header: ", accept_header
    @task = Task.new(task_params)

    if @task.save

UPDATE "tasks" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["title", "edited title"], ["description", "edited description"], ["updated_at", 2016-08-23 19:30:55 UTC], ["id", 1]]
---
  def update
    if @task.update(task_params)