app/controllers/users_controller.rb

  def create
		p "user create action"

	  # If request includes a Facebook token, get the user info from the Facebook graph
		# API, create a new user from user Facebook info, and ignore other params
		if params[:user][:facebook_token]
			token = params[:user][:facebook_token]
			response = HTTParty.get("https://graph.facebook.com/me?access_token=#{token}")
			hash = JSON.parse response.body
			fb_id = hash["id"].to_i
			fb_name = hash["name"]
			pw = SecureRandom.urlsafe_base64
			email = SecureRandom.urlsafe_base64 + "@example.com"

			if fb_id == 0
				render :json => {:error => "Facebook token expired"}
				return
			end

			@user = User.new(name: fb_name, facebook_id: fb_id, email:email, password: pw, password_confirmation: pw)

    # Otherwise, create a new user from name and email params
		else
			p "new from params"
			@user = User.new(user_params)
		end

    if @user.save
---
INSERT INTO "users" ("name", "email", "facebook_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Joe"], ["email", "joe@example.com"], ["facebook_id", 1234], ["created_at", 2016-08-22 19:21:24 UTC], ["updated_at", 2016-08-22 19:21:24 UTC]]

	def login_user
		# If user logs in with Facebook token, look up the user by Facebook id
		p "user login happening"
		if params[:user][:facebook_token]
			token = params[:user][:facebook_token]
			response = HTTParty.get("https://graph.facebook.com/me?access_token=#{token}")
			hash = JSON.parse response.body
			fb_id = hash["id"].to_i
			@user = User.find_by(facebook_id: fb_id)

			if fb_id == 0
				render :json => {:error => "Facebook token expired"}
				return
			end
		# If user logs in with email and password, use Rails' authenticate method
		else
			user = User.find_by(email: params[:user][:email])
			@user = user.authenticate(params[:user][:password])
		end

		if !@user
			render :json => {:error => "User not found"}
			return
		end

		# Generate and save a new authentication token on successful login
		@user.generate_authentication_token
		@user.save
---
SELECT  "users".* FROM "users" WHERE "users"."facebook_id" = $1 LIMIT $2  [["facebook_id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "user@example.com"], ["LIMIT", 1]]
UPDATE "users" SET "auth_token" = $1, "auth_expires_at" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["auth_token", "yzMcQMwmDiIdmHcWyMVWyw"], ["auth_expires_at", 2016-08-24 20:38:42 UTC], ["updated_at", 2016-08-23 20:38:42 UTC], ["id", 1]]